W8D1/RedditClone/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "This is not a great post"], ["author_id", 14], ["post_id", 12], ["created_at", "2020-11-10 01:35:00.877892"], ["updated_at", "2020-11-10 01:35:00.877892"]]