W8D1/RedditClone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        # @post = current_user.posts.new(post_params)
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["url", "google.com"], ["content", "fdjklsa;df"], ["sub_id", 5], ["created_at", "2020-11-09 22:05:37.828431"], ["updated_at", "2020-11-09 22:05:37.828431"], ["author_id", 15]]

    def edit
        @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update
        @post = Post.find_by(id: params[:id])
        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["url", "google.com"], ["content", "lolllll'ing"], ["updated_at", "2020-11-09 22:27:18.487932"], ["id", 5]]