W8D1/RedditClone/app/controllers/subs_controller.rb

  def edit
    @sub = Sub.find_by(id: params[:id])
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    @sub = Sub.find_by(id: params[:id])

    if @sub.update(sub_params)
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "greatest sub"], ["updated_at", "2020-11-10 00:47:22.569228"], ["id", 6]]

  def index
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def show
    @sub = Sub.find_by(id: params[:id])
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new sub for bastoul"], ["description", "great sub"], ["moderator_id", 15], ["created_at", "2020-11-10 00:47:08.542655"], ["updated_at", "2020-11-10 00:47:08.542655"]]