W8D1/RedditClone/app/views/posts/show.html.erb

  <option selected disabled>---This post's subs---</option>
  <% @post.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 12]]

  <div style="padding: 5px"></div>
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 12]]