W7D2/MusicApp/app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "POKmeQcVNe4fjc3cU5tTVg"], ["LIMIT", 1]]