W6D4/art_share_pt2/app/controllers/artworks_controller.rb

    def index
        # artworks = Artwork.where(artist_id: params[:user_id])
        # debugger
        user = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

    def create
        artwork = Artwork.new(artwork_params)

        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "starry night"], ["image_url", "www.hellofakesite.com"], ["artist_id", 11], ["created_at", "2020-10-29 21:44:22.921710"], ["updated_at", "2020-10-29 21:44:22.921710"]]

    def show
        render json: Artwork.find_by(id: params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def destroy
        artwork = Artwork.find_by(id: params[:id])
        artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]

    def update
        artwork = Artwork.find_by(id: params[:id])
        if artwork.update(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "the david"], ["image_url", "www.google.com"], ["artist_id", 13], ["updated_at", "2020-10-29 21:46:24.215655"], ["id", 1]]