W6D4/art_share_pt2/app/controllers/artwork_shares_controller.rb

    def create
        artwork_share = ArtworkShare.new(artwork_share_params)

        if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 13], ["created_at", "2020-10-29 22:21:36.327405"], ["updated_at", "2020-10-29 22:21:36.327405"]]

    def destroy
        artwork_share = ArtworkShare.find_by(id: params[:id])
        artwork_share.destroy
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]