W6D4/art_share_pt2/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 16]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 16]]
SELECT "comments".* FROM "comments"
---
    def index
        author_id = params[:comment][:author_id]
        artwork_id = params[:comment][:artwork_id]

        if author_id
            comments = Comment.where(author_id: author_id)
        elsif artwork_id
            comments = Comment.where(artwork_id: artwork_id)
        else
            comments = Comment.all

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Meh, it looks low-effort"], ["author_id", 16], ["artwork_id", 2], ["created_at", "2020-10-29 23:36:46.274804"], ["updated_at", "2020-10-29 23:36:46.274804"]]
---
    def create
        comment = Comment.new(comment_params)

        if comment.save