W6D4/art_share_pt2/app/controllers/users_controller.rb

    def index
        p params
        if params[:query]
            users = User.where(username: params[:query])
        else
            users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "awesome"]]
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)

        if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "awesome4"], ["created_at", "2020-10-29 15:57:20.509356"], ["updated_at", "2020-10-29 15:57:20.509356"]]

    def show
        render json: User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def destroys
        user = User.find_by(id: params[:id])
        user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]

    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "tony"], ["email", "kevin.park@gmail.com"], ["updated_at", "2020-10-28 22:25:07.847827"], ["id", 8]]