W11D1/todosPt2/app/controllers/api/todos_controller.rb

    def show
        render json: Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]