W6D3/first_routes_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        users = User.all

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "tony"], ["email", "tony@gmail.com"], ["created_at", "2020-10-28 22:01:48.913996"], ["updated_at", "2020-10-28 22:01:48.913996"]]
---
    def create
        user = User.new(user_params)

        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        render json: User.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
    def destroy
        user = User.find_by(id: params[:id])
        user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "tony"], ["email", "kevin.park@gmail.com"], ["updated_at", "2020-10-28 22:25:07.847827"], ["id", 8]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)