W6D5/NinetyNineCats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" ORDER BY "cats"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index
        @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find(params[:id])

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @cat = Cat.find_by(id: params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "kitty kat"], ["color", "white"], ["updated_at", "2020-10-30 23:24:26.869699"], ["id", 1]]
---
    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update(cat_params)